{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "simulation_credit",
    "1": "demande_credit",
    "2": "information_produit",
    "3": "calcul_financier",
    "4": "support_client",
    "5": "modification_simulation"
  },
  "initializer_range": 0.02,
  "label2id": {
    "calcul_financier": 3,
    "demande_credit": 1,
    "information_produit": 2,
    "modification_simulation": 5,
    "simulation_credit": 0,
    "support_client": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.35.2",
  "vocab_size": 30522
}
